src/cfe/InformationRegisters/http_ЖурналВходящихЗапросов.xml
<?xml version="1.0" encoding="utf-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>http_ЖурналВходящихЗапросов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаЗапроса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сервис</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ресурс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Метод</Name>
					<Type>
						<v8:Type>d5p1:EnumRef.http_HTTPМетоды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодСостояния</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Запрос</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерЗапроса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерОтвета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОтвета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КлючИдемпотентности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>&#13;
			<Resource>
				<Properties>
					<Name>ХешЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>&#13;
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/CommonModules/http_ИдемпотентностьСлужебный/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////
// http_ИдемпотентностьСлужебный
//
// Проверка идемпотентности HTTP-запросов согласно спецификации
// "The Idempotency-Key HTTP Header Field"
//   https://www.ietf.org/archive/id/draft-ietf-httpapi-idempotency-key-header-01.html
// Ошибки оформляются по RFC 7807 (application/problem+json).
//
// Логика:
//  1. Если в маршруте идемпотентность не включена - пропускаем.
//  2. Если включена, а заголовок Idempotency-Key отсутствует - 400 + ссылка на RFC.
//  3. Считаем хеш входящего запроса (URL + параметры + тело).
//  4. Ищем в журнале запрос с тем же ключом для того же сервиса:
//      - успешный (200..299) и хеш совпадает -> отдаём кэш (200);
//      - успешный, хеш не совпадает          -> 422 Unprocessable Entity;
//      - незавершённый (КодСостояния=0)      -> 409 Conflict (другой клиент
//                                              уже выполняет тот же запрос);
//      - не найден                           -> идём дальше, текущий запрос
//                                              будет зафиксирован при записи
//                                              в журнал.
//
// На уровне http_HTTPКонвейера этот модуль вызывается между авторизацией и
// парсингом тела. Записать ключ+хеш в журнал - задача шага логирования,
// см. http_HTTPКонвейер.ЛогироватьНачалоЗапроса.
///////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Ссылка на спецификацию заголовка Idempotency-Key.
Функция АдресСпецификации() Экспорт

	Возврат "https://www.ietf.org/archive/id/draft-ietf-httpapi-idempotency-key-header-01.html";

КонецФункции

// Считает хеш запроса (URL + параметры + тело) - MD5 hex.
// Используется как при первичной записи запроса в журнал, так и при
// сверке повторного запроса.
//
// Параметры:
//  Запрос - HTTPСервисЗапрос, HTTPЗапрос
//
// Возвращаемое значение:
//  Строка - 32-значный hex.
//
Функция ХешЗапроса(Запрос) Экспорт

	ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.MD5);

	Адрес = http_АдаптерЗапросОтветСлужебный.ЗапросАдрес(Запрос);
	ХешированиеДанных.Добавить(Адрес);

	Для Каждого Параметр Из Запрос.ПараметрыЗапроса Цикл
		ХешированиеДанных.Добавить(Параметр.Ключ);
		ХешированиеДанных.Добавить(Параметр.Значение);
	КонецЦикла;

	Попытка
		ТелоДвоичные = Запрос.ПолучитьТелоКакДвоичныеДанные();
		Если ТелоДвоичные <> Неопределено Тогда
			ХешированиеДанных.Добавить(ТелоДвоичные);
		КонецЕсли;
	Исключение
		ОписаниеОшибкиИгнорируется = ОписаниеОшибки();
	КонецПопытки;

	Возврат НРег(СтрЗаменить(ХешированиеДанных.ХешСумма, " ", ""));

КонецФункции

// Проверяет идемпотентность согласно настройкам маршрута.
//
// Параметры:
//  Контекст                - Структура - контекст конвейера.
//  НастройкиИдемпотентности - Структура / Булево / Неопределено - см.
//      http_СерверКлиентСервер.НовыйПараметрыМаршрута(). Формат:
//      Неопределено / Ложь -> пропустить шаг;
//      Истина              -> включить с дефолтами;
//      Структура с полями:
//        * ИмяЗаголовка - Строка - имя заголовка (по умолчанию "Idempotency-Key").
//
// Возвращаемое значение:
//  Булево - Истина если можно продолжать обработку,
//           Ложь если ответ уже сформирован (ошибка или кэш).
//
Функция ПроверитьЗапрос(Контекст, НастройкиИдемпотентности) Экспорт

	Если НастройкиИдемпотентности = Неопределено
		Или НастройкиИдемпотентности = Ложь Тогда
		Возврат Истина;
	КонецЕсли;

	ИмяЗаголовка = "Idempotency-Key";
	Если ТипЗнч(НастройкиИдемпотентности) = Тип("Структура")
		И НастройкиИдемпотентности.Свойство("ИмяЗаголовка")
		И Не ПустаяСтрока(НастройкиИдемпотентности.ИмяЗаголовка) Тогда
		ИмяЗаголовка = НастройкиИдемпотентности.ИмяЗаголовка;
	КонецЕсли;

	Ключ = http_АдаптерЗапросОтветСлужебный.ЗапросЗаголовок(Контекст.HTTPЗапрос, ИмяЗаголовка);
	Если ПустаяСтрока(Ключ) Тогда
		http_HTTPКонвейер.УстановитьОшибку(Контекст, 400,
			"Идемпотентность: отсутствует заголовок " + ИмяЗаголовка, АдресСпецификации());
		Возврат Ложь;
	КонецЕсли;

	Хеш = ХешЗапроса(Контекст.HTTPЗапрос);

	// Сохраняем ключ+хеш в контекст - они пригодятся ЛогироватьНачалоЗапроса
	// чтобы записать их в журнал и сделать запрос обнаруживаемым повторно.
	Контекст.Свойства.Вставить("КлючИдемпотентности", Ключ);
	Контекст.Свойства.Вставить("ХешЗапроса",          Хеш);

	Возврат ОбработатьПовтор(Контекст, Ключ, Хеш);

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Ищет ранее зафиксированный запрос с тем же ключом для того же сервиса.
// Возвращает Истина если можно продолжать (нет конфликтов), Ложь если
// ответ уже сформирован (отдан кэш или установлена ошибка 409/422).
Функция ОбработатьПовтор(Контекст, Ключ, Хеш)

	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Журнал.КодСостояния    КАК КодСостояния,
		|	Журнал.ХешЗапроса      КАК ХешЗапроса,
		|	Журнал.Ответ           КАК Ответ,
		|	Журнал.ДатаЗапроса     КАК ДатаЗапроса
		|ИЗ
		|	РегистрСведений.http_ЖурналВходящихЗапросов КАК Журнал
		|ГДЕ
		|	Журнал.Сервис              = &Сервис
		|	И Журнал.КлючИдемпотентности = &Ключ
		|	И Журнал.Идентификатор     <> &Идентификатор
		|УПОРЯДОЧИТЬ ПО
		|	Журнал.ДатаЗапроса УБЫВ");
	Запрос.УстановитьПараметр("Сервис",       Контекст.Сервис);
	Запрос.УстановитьПараметр("Ключ",         Ключ);
	Запрос.УстановитьПараметр("Идентификатор", Контекст.Идентификатор);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат Истина; // ранее запросов с таким ключом не было - продолжаем
	КонецЕсли;

	КодСостояния       = Выборка.КодСостояния;
	ЭтоУспешный        = КодСостояния >= 200 И КодСостояния <= 299;
	ЭтоВыполняется     = КодСостояния = 0;
	ХешСовпадает       = (Выборка.ХешЗапроса = Хеш);

	Если ЭтоВыполняется Тогда
		// Параллельный запрос с тем же ключом ещё обрабатывается
		http_HTTPКонвейер.УстановитьОшибку(Контекст, 409,
			"Параллельный запрос с тем же Idempotency-Key ещё обрабатывается",
			АдресСпецификации());
		Возврат Ложь;
	КонецЕсли;

	Если ЭтоУспешный И ХешСовпадает Тогда
		ВернутьКэшированныйОтвет(Контекст, Выборка);
		Возврат Ложь;
	КонецЕсли;

	Если ЭтоУспешный И Не ХешСовпадает Тогда
		// Тот же ключ, но запрос изменился - 422
		http_HTTPКонвейер.УстановитьОшибку(Контекст, 422,
			"Тот же Idempotency-Key использован для другого запроса",
			АдресСпецификации());
		Возврат Ложь;
	КонецЕсли;

	// Прошлый запрос завершился ошибкой - разрешаем повтор
	Возврат Истина;

КонецФункции

// Возвращает кэшированный ответ из журнала.
Процедура ВернутьКэшированныйОтвет(Контекст, Выборка)

	Ответ = Контекст.HTTPОтвет;
	http_АдаптерЗапросОтветСлужебный.ОтветУстановитьКод(Ответ, Выборка.КодСостояния);
	http_АдаптерЗапросОтветСлужебный.ОтветУстановитьТипСодержимого(Ответ,
		"application/json; charset=utf-8");
	http_АдаптерЗапросОтветСлужебный.ОтветУстановитьЗаголовок(Ответ, "X-Idempotency-Cache", "HIT");

	ТелоОтвета = ?(ПустаяСтрока(Выборка.Ответ), "", Строка(Выборка.Ответ));
	Если Не ПустаяСтрока(ТелоОтвета) Тогда
		http_АдаптерЗапросОтветСлужебный.ОтветУстановитьТело(Ответ, ТелоОтвета);
	КонецЕсли;

	Контекст.ТелоОтвета = ТелоОтвета;
	// Помечаем, что ответ уже отдан - конвейер должен пропустить остальные шаги
	Контекст.Свойства.Вставить("ИдемпотентныйКэш", Истина);

КонецПроцедуры

#КонецОбласти
